In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.DataFrame({'client_id': [9002, 6722, 8799, 8737, 5208],
                  'sex': [1, 1, 1, 0, 0],
                  'wealth': ['medium', 'high', 'high', 'low', 'medium'],
                  'age': [63, 54, 62, 54, 37]})
df

   client_id  sex  wealth  age
0       9002    1  medium   63
1       6722    1    high   54
2       8799    1    high   62
3       8737    0     low   54
4       5208    0  medium   37

In [11]:
data = pd.DataFrame({'client_id': [5392, 9581, 7250, 8619, 6573], 
                     'amount': [42331, 88420, 1714, 80572, 57549], 
                     'date': [1585425830, 1585429536, 1585427761, 1585427077, 1585426290]})
data

   client_id  amount        date
0       5392   42331  1585425830
1       9581   88420  1585429536
2       7250    1714  1585427761
3       8619   80572  1585427077
4       6573   57549  1585426290

In [12]:
full_data = pd.merge(df, data, on='client_id')
full_data

Empty DataFrame
Columns: [client_id, sex, wealth, age, amount, date]
Index: []